{
  "conversations": [
    [
      "How do I register for selfie?",
      "In order to use SELFIE, you must first create an account for your school through the link you can find at\n  https://ec.europa.eu/education/schools-go-digital.\n  You should use an e-mail account which you have access to (eg the official e-mail address of the school) rather\n  than a personal one. If the school coordinator changes it means your school can keep the same address for\n  SELFIE."
    ],
    [
      "How do I login?",
      "Once registered, you will be able to log into SELFIE by going to https://ec.europa.eu/education/schools-go-\n  digital or https://schools-go-digital.jrc.ec.europa.eu and using the school’s email address and the newly\n  created password.\n  This will take you to the School Profile page on which you will be asked to provide some information about\n  your school, most of which is optional, such as an additional email address. Please check your school profile at\n  least once per year and make updates if needed.\n  The School Profile page is available on the right side of the main SELFIE menu once you log in to the school’s\n  account."
    ],
    [
      "How do I navigate within SELFIE?",
      "In the menu at the top of the SELFIE screen, there are different tabs, that can be used to navigate between the\n  different areas of the tool: About SELFIE, Set-up, Results, Certification, Resources, Upcoming Sessions, Data\n  Protection and School Profile."
    ],
    [
      "How do I set SELFIE up for my school?",
      "You can only set up for the current SELFIE session. This means if you are logging in during the time period of\nsession 1, you can't set up in advance for session 2."
    ],
    [
      "How do I choose who will take part in SELFIE?",
      "You can choose an education level to survey by selecting Set Up>Step 1: Select education level and choosing\none of five options:\n1.\n2.\n3.\n4.\n5.\nprimary education\nlower secondary education\nupper secondary general education\nupper secondary vocational education\npost-secondary non-tertiary education\nYou can choose more than one education level to survey at any one time."
    ],
    [
      "What information do I need to add about participants?",
      "You will need to enter the total number of school leaders, teachers and students, and the numbers that will be\ninvited to take part in SELFIE.\nYou can find guidance on how many staff and students should take part in SELFIE in the section What are the\nminimum participation rates?\nDefinitions\nIn this context, the term school leader refers to the school head/principal or deputy head/principal but it can\nalso include those in senior management or leadership roles. School heads and deputy heads should be\nconsidered as school leaders even if they also have teaching duties.\nThe term teacher includes teachers and other professional staff who are directly involved in teaching students.\nAny teacher who has worked in the school for at least one academic year should be invited to participate.\nThose class teachers with management or leadership responsibilities can be included either as a school leader\nSELFIE guide for School coordinators\n5or as a teacher or as both. In the latter case, they would complete two questionnaires, one as a school leader\nand one as a teacher.\nThe term student refers to a pupil enrolled in the school. For ISCED 1 (primary), only students who are aged 9\nand over are considered eligible, as children below this age may not fully understand the wording of the\nquestions.\nClick on the \"Save set up\" button on the right side, at the bottom of the page, to save this step and be\nautomatically redirected to the Steps menu. If you make changes, the button will be called \"Update the set-\nup\"."
    ],
    [
      "AM I ABLE TO CUSTOMISE THE QUESTIONNAIRES?",
      "You can customise the questionnaires by selecting Customise the questionnaires from the “Steps” menu in Set-up, which will enable you either to add optional questions or to create your own. Question types Each of the three questionnaires is already populated with a set of core questions organised into six common practice areas: Area A: Leadership Area B: Infrastructure and equipment Area C: Continuing Professional Development Area D: Teaching and Learning Area E: Assessment practices Area F: Student Digital Competence. Optional questions, can be added to the core set of questions in order to tailor the questionnaires precisely to your school’s needs. You can also create up to 10 of your own questions (school specific questions) from scratch. Before selecting or creating questions, it is advisable to download and carefully read through the complete list of core and optional questions of SELFIE for school leaders, teachers and students, available in the Customize the questionnaires section of the tool and in the Resources section. You will need to choose the language in which you want to download the statements list from the drop-down menu."
    ],
    [
      "HOW DO I ADD AN OPTIONAL STATEMENT?",
      "Add optional questions by selecting Manage optional statements and then selecting the education level. The optional statements are displayed per area like the core statements. Click on each area to display the optional statements. Add questions by checking the box next to each question. Once you have selected all the questions you deem relevant for an educational level, click on the “Save selected questions” button at the bottom of the page. Then click on Back to continue customising the questionnaire. You will need to repeat this process for all education levels that you have selected to survey. The education level can be changed using the drop down menu. "
    ],
    [
      "HOW DO I CREATE MY OWN STATEMENTS?",
      "You can create up to ten questions by selecting the Manage your own statements option, choosing the education level, and entering the question and help text that you want to display. You will need to create a version of each statement and accompanying help text for each user group. The help text should be a statement of highly effective practice, i.e. it should provide a description of the circumstances under which the question or statement would attract a five-point rating. Additional statements will need to be worded in line with the agreement answer scale so that users can respond by selecting one of the following options: Strongly disagree – In my experience, this is not true at all / Disagree / Slightly agree / Agree / Strongly agree – In my experience, this is very true. To add a statement, enter the text in the Statement window for the relevant category (School Leader, Teacher, Student), and the help text in the Help window, then click on the Save blue button. This will save your statement and automatically open a new blank one. If you have finished adding statements, you need to go back to the Step 2 through the Set Up tab and select the relevant education level in order to preview your questionnaires, with the optional and custom statements you have added. Before you create your own statements, check the core and optional statements list to avoid duplicates. ------- Questions can be edited through the Edit facility up until you generate the links, after what, no further change is admitted. If you leave the Customise your questionnaire screen, your set-up is automatically saved until the end of the current SELFIE session. The set-up and the customised questionnaires don't save for future sessions. Once you have verified your questionnaires through the preview, you must go back to the Steps menu in order to either edit either set up new steps."
    ],
    [
      "HOW DO I SELECT DATES?",
      "To choose dates, go to Set-up>Step 3: Select dates. Choose the education level, and then on the calendar, click on the start date, then the end date. When you move the cursor to the right from the start date, all the eligible end dates will show in light blue, until you reach the end of the session, or the 3 weeks’ time extension. The time slot to take the survey must be between one and three weeks. THE DATES CAN’T BE EXTENDED, REDUCED OR CHANGED once you will finalise Step 4>Activate/see links. During the survey, participants who didn’t submit a questionnaire on time won’t be able to access it anymore. You have the option here to change the default language that you want SELFIE to be displayed in using the drop-down languages menu."
    ],
    [
      "HOW DO I GENERATE AND DISTRIBUTE THE LINKS?",
      "In the Set-up menu, go to Step 4: Activate/see links. There you can give your configuration a last check before to activate the links. The Step 4 is final: once you activate the links by clicking on the Generate links button, nothing can be changed anymore in the configuration for the selected education level This will display three links, one for each participants category (school leaders, teachers, students) in the education level selected. Icons will enable you to copy the links (you can then just do right click+paste to paste it wherever you need) and to preview each questionnaire exactly as it will appear for the user."
    ],
    [
      "HOW DOES A USER TAKE THE QUESTIONNAIRE?",
      "The participants access the questionnaires through the links created in SELFIE. Participation should be on a voluntary basis and will be anonymous. Users do not need to login to SELFIE and do not require a username or password. The links can be copied and distributed by email or by being published, for example, on the school’s shared drive. School leaders and teachers who work across education levels, for example, in both primary and lower secondary, will need to complete a questionnaire for each level. Once a participant clicks on the link, from an email for example, the questionnaire will open exactly as it did in the preview. At this stage the user can change the language in which SELFIE is displayed using the drop down menu, however this should be done at the outset as doing it after the survey has started will delete the answers. The user can then navigate through the various sections of the questionnaire and submit their answers at the end. It is recommended that younger students complete the questionnaires as a whole class activity with a teacher. For students this should take no more than 20 minutes and for teachers no more than 40. However, the questionnaire must be completed within two hours of starting. Once the survey has been submitted, a Get Participation Certificate link will appear. Clicking on this will open a printable certificate signed by European Commission, which the user can personalise, if he or she wishes to do so, by adding his or her name. The name entered is NOT stored as participation in SELFIE is anonymous. Please remind staff and students that certificates cannot be generated at a later date as no data on individual users is stored. The link to the certificate is temporary and can’t be stored, for example, in an e-mail.SELFIE can be used on a variety of devices such as personal computers, laptops, tablets and smartphones. It also works on all main browsers including Mozilla Firefox, Chrome, Internet Explorer, Edge, Opera, and Safari. SELFIE is securely hosted on European Commission servers and it is covered by personal data protection, privacy statements and copyright legislation. Further information can be accessed at https://ec.europa.eu/education/tools/selfie/privacy_en and in the Data Protection section of the main menu."
    ],
    [
      "WHAT ARE THE MINIMUM PARTICIPATION RATES?",
      "As SELFIE will use the information obtained from the questionnaires to create a snapshot of where the school is in relation to its use of digital technologies, in principle, the greater the number of questionnaires submitted, the more accurate and useful this information will be. Minimum participation rates have been established in order to guide schools in this respect. The tables below provide the minimum percentage participation rates for school leaders, teachers and students per education level (e.g. primary, lower-secondary). For example, if there are 5 school leaders in primary, then the minimum participation rate is 80%, which means that at least 41 school leaders have to participate to reach the minimum threshold. In the case of teachers, if there are 100 teachers in, for example, the upper secondary school level, at least 33% need to participate. For students, if there are 200 students in, for example, a lower-secondary school, the minimum participation rate is 40%, meaning that 80 students should participate. For all three user-groups, schools can of course include more than just the minimum number indicated in the tables above and this is highly recommended. There are 4 levels of participation achievable in a SELFIE self-assessment exercise: High participation: Each of the three user groups (teachers, school leaders and students) achieves the minimum participation rate as indicated in the tables above, or the participation of two user groups is high and that of the third group is close to the recommended rate.  Medium participation: Participation of at least two out of three user groups is lower than that recommended. SELFIE guide for School coordinators 12 Incomplete participation: At least one out of three user groups has not participated in which case, a watermark in the results section indicates that participation has been incomplete. No participation: No users have submitted a questionnaire. "
    ],
    [
      "AM I ABLE TO MONITOR PARTICIPATION RATES?",
      "You will be able to monitor in real time the numbers of school leaders, teachers and students who have completed the survey, once the process is underway. This information will only appear once the links to the questionnaires have been generated and will be displayed as an interactive bar chart on the SELFIE dashboard. Hovering over the bars will provide information for the level being surveyed including the user group, the number of users who have been invited to take part and the percentage completion rate as well as the recommended minimum number for each user group. Download and Print options are also available."
    ],
    [
      "HOW DO I OBTAIN THE OPEN DIGITAL BADGE FOR MY SCHOOL?",
      "The process to get an Open Badge for your school is summarized in the Certification section of the main menu, on the left side of the screen, under Get a SELFIE open badge for your school. Any school that has participated in SELFIE has the opportunity to obtain an open digital badge. Open badges are tokens of recognition or accomplishment issued online by organisations usually to reward an individual’s achievements. The SELFIE open badge however is a badge for schools; it is school specific and can be used on the school’s blog, websites, and social media applications or within the school email signature. It will display the school name or the short form of the school name if it has been entered in the school profile. SELFIE open badges are issued in collaboration with the Spanish Ministry of Education, Culture and Sports. In particular, to get the digital/open badge you must first register with Insignias INTEF Open Badge Backpack of the Spanish Ministry of Education, Culture and Sports (available in Spanish and English). You need to create an account for your school and then use the account login credentials to retrieve the badge.. To create an account you will need to go to https://insignias.educacion.es/en and input the same email address that you used to log into the SELFIE tool. You will receive an account registration authorisation link by email to the school’s email account. If this does not appear please check the spam folder. The link within the email will take you to a login page and then to an account details page where you will need to provide the name of your school (as to appear in the open badge) and the same school email address that you used to log into SELFIE with. You will then be asked to type a new password and to retype it to confirm. Once this is done, you will need to send an email to JRC-EAC-SELFIE-TOOL@ec.europa.eu confirming that you have completed the steps to register for the badge including the following information: -subject: Open Badge request for [name of your school][country] -name of your school as registered in SELFIE and INTEF -e-mail you used to register in INTEF with It can take up to one month to receive a badge. You will receive an email from the Insignias INTEF Open Badge Backpack stating that the open badge has been issued to your school. To retrieve the badge, log in using the school’s email address and the password that you created during registration, select My badges then use Right Click and Save Image as from the drop-down menu to download the badge as an image or you can use the social media buttons displayed here to share it."
    ],
    [
      "HOW DO I VIEW THE RESULTS?",
      "Once the timeslot for the questionnaire has closed, the results for the school will be available by selecting the Results section in the main menu, which will open the SELFIE School Report screen. In this screen you can compare results with a previous SELFIE exercise. Results are only available at the end of the timeslot you chose for SELFIE. This is the case even if participation rates are reached before the final date. To view results from a previous session, select the relevant session's name through the sessions' selector in the Results>SELFIE school report page. If more than one education level has been surveyed, they will be listed here. If you ran SELFIE in both primary and lower secondary, you will need to select the level that you want to view results for. Once checked, the screen will expand to show the following sections: ● How to use the report ● SELFIE areas ● Statements added by your school ● Additional areas The first section shows the timeslot within which this SELFIE has been taken, together with an overview of the final participation rates. The second, third and fourth section display the actual results using interactive graphics. Go to Section 2: Making the most of the SELFIE School Report within this guide for detailed information on how to view, interpret and use the SELFIE results. Each school and only that school will have access to the information displayed and it will be up to the school to decide how to use the results. Policy makers and researchers will be able to receive aggregated and anonymised data from your country/region but they will not be able to see the results from individual schools or participants."
    ],
    [
      "HOW CAN I CONTACT THE SELFIE TEAM?",
      "Should you wish to contact the SELFIE team, for instance to report a technical issue, ask questions or propose improvements, please send an email to JRC-EAC-SELFIE-TOOL@ec.europa.eu To report a technical issue, please include the following specific information: When asking questions or proposing improvement, please include a relevant subject in the subject field such as Answers needed or Suggested improvements. "
    ],
    [
      "HOW TO FIND OUT MORE ABOUT SELFIE?",
      "The SELFIE website (https://ec.europa.eu/education/schools-go-digital) and the Resources section includes videos and information about the tool. The Data privacy statement is available in the relevant section. In the News section of the website, you can find the most recent information about events and resources related to SELFIE and the use of digital technologies for learning in the digital age. You can also sign up for the SELFIE newsletter to receive the latest information and be in touch with the SELFIE community, every 6 weeks and directly in your mailbox! Also, through the hashtag #SELFIE_EU you can take part in the discussions about the tool in Twitter. Stay tuned!"
    ]
  ]
}